# Control Flow - Control Statement
# ในทางโปรแกรมคอมพิวเตอร์ ผล->พิสูจน์/ตรวจสอบ/ตัดสินใจ->True/False
# Selection/Condition สำหรับโพเซสการทำงานที่ต้องมีการพิสูจน์/ตรวจสอบ/ตัดสินใจก่อนที่จะทำงานใดๆ
# 1. พิสูจน์ครั้งเดียวจริงทำเท้จไม่ทำ ใช้ if
# 2. พิสูจน์ครั้งเดียวจริงทำอีกอย่าง เท็จทำอีกอย่าง ใช้ if-else
# 3. พิสูจน์หลายครั้ง ใช้ if-else-if

# Loop/Repeat/Iteration สำหรับโพรเซสการทำงานเดิมๆ ซ้ำๆ
# การทำงานเดิมๆ ซ้ำแต่ละครั้ง ข้อมูลที่เอามาทำซ้ำไม่จำเป็นต้องเหมือนกัน และผลลัพธ์ที่ได้แต่ละครั้งก็ไม่จำเป็นต้องเหมือนกัน
# มีแบบรู้จำนวนครั้งในการทำงานซ้ำ
# กับแบบไม่รู้จำนวนครั้งในการทำงานซ้ำ (แต่ต้องรู้จบ)
# while, for