# ทำโปรแกรมคิดค่า Commission สำหรับพนักงานขาย โดยให้ป้อนชื่อพนักงาน และยอดขายทางแป้นพิมพ์
# และแสดงผลข้อมูลที่ป้อนและคำนวณได้ทางหน้าจอ โดย ค่า Commission คิดจากยอดขาย
# - ยอดขายไม่เกิน 100000 คิดค่าคอม 10% ของยอดขาย
# - ยอดขายมากกว่า 10000 คิดค่าคอม 15% ของยอดขาย
print('++++++++++++++++++++++++++++++')
print('---โปรแกรมคิดค่า Commission ---')
print('++++++++++++++++++++++++++++++')

emp_name = input('ป้อนชื่อพนักงาน : ')
emp_sale = input('ป้อนยอดขาย : ')
print('++++++++++++++++++++++++++++++')

if float(emp_sale) <= 100000 :
    commission = f'{(float(emp_sale) * 0.1):,.2f}'
else :
    commission = f'{float(emp_sale) * 0.15:,.2f}'

print(f'คุณ {emp_name} ยอดขาย {emp_sale} บาท ได้รับค่าคอมมิชชั่นเป็น {commission} บาท')