# ทำโปรแกรมสอบถามข้อมูลสายรถเมล์ โดยให้ป้อนสายรถเมล์ที่ต้องการ และแสดงผลข้อมูลว่าไปไหน
# 84 แสดงข้อความไป ไป อ้อมน้อย วัดไร่ขิง
# 81 แสดงข้อความไป ไป พรานก ศิริราช
# 80 แสดงข้อความไป ไป สนามหลวง บางขุนนนท์ ปิ่นเกล้า
# 8  แสดงข้อความไป ไป สะพานพุทธ เดอะมอล์บางกะปิ
# 7  แสดงข้อความไป ไป คลองเตย พระประแดง 
# สายอื่นๆ แสดงข้อความ ยังไม่มีข้อมูล

print('+++++++++++++++++++++++++++++++++')
print('---โปรแกรมสอบถามข้อมูลสายรถเมล์---')

bus_number = input('ป้อนสายรถเมล์ : ')
print('+++++++++++++++++++++++++++++++++')
if bus_number == '84' :
    print('ไป อ้อมน้อย-วัดไร่ขิง')
elif bus_number == '81' :
    print('ไป พรานก ศิริราช')
elif bus_number == '80' :
    print('สนามหลวง บางขุนนนท์ ปิ่นเกล้า')
elif bus_number == '8' :
    print('สะพานพุทธ เดอะมอล์บางกะปิ')
elif bus_number == '7' :
    print('คลองเตย พระประแดง')
else :
    print('ยังไม่มีข้อมูล')
print('+++++++++++++++++++++++++++++++++')