# คำสั่งที่แสดงผลข้อมูลที่แตกต่างกันใน print() เดียว
# มีให้เลือกใช้ 4 วิธี
# ใช้ , โดยทุกๆ coma จะเว้นวรรค 1 ช่องว่าง (1 space)
print('สวัสดี',555,'wow wow wow',True,999,'Hi...',10+20)

# ใช้ + แต่มีข้อแม้ คือ ข้อมูลใดที่ไม่ใช้ String ต้องแปลให้เป็น String 
# คำสั่งที่ใช้แปลง String คือ str(???) แล้วก็ไม่มีเว้นวรรคให้เหมือน ,
print('สวัสดี'+str(555)+'wow wow wow'+str(True)+str(999)+'Hi...',str(10+20))
print('สวัสดี '+str(555)+' wow wow wow '+ str(True)+' '+ str(999)+' Hi...',str(10+20))
# ใช้ เมธอด format( ) แต่มรีข้อมูล คือ ข้อมูล ใดที่ไม่ใช่ String ให้เอาไปใส่ในวงเล็บของ format ( )
# และตำแหน่งที่จะแสดงข้อมูลนั้นให้ใส่เป็น {}
print('สวัสดี {} wow wow wow {} {} Hi... {}'.format(555, True, 999,10+20))

# ใช้ f-string  ต้องมีตัว f อยู่ข้างหน้า และตรงไหนที่ไม่ใช่ String ให้เขียนใน {???}
print(f'สวัสดี {555} wow wow wow {True} {999} Hi... {10+20}')